{
    "music": [

        {
            "name": "Alive",
            "local": "Alive",
            "album":"The End",
            "artist":"Black Eyed Peas",
            "genre": "Hip Hop"
        },
        {
            "name": "Boom Boom Pow",
            "local": "BoomBoomPow",
            "album":"The End",
            "artist":"Black Eyed Peas",
            "genre": "Hip Hop"
        },
        {
            "name": "Imma Be",
            "local": "ImmaBe",
            "album":"The End",
            "artist":"Black Eyed Peas",
            "genre": "Hip Hop"
        },
        {
            "name": "Missing You",
            "local": "MissingYou",
            "album":"The End",
            "artist":"Black Eyed Peas",
            "genre": "Hip Hop"
        },
        {
            "name": "Now Generation",
            "local": "NowGeneration",
            "album":"The End",
            "artist":"Black Eyed Peas",
            "genre": "Hip Hop"
        },
        {
            "name": "Rock That Body",
            "local": "RockThatBody",
            "album":"The End",
            "artist":"Black Eyed Peas",
            "genre": "Hip Hop"
        },
        {
            "name": "Darlene",
            "local": "Darlene",
            "album":"Coda",
            "artist":"Led Zeppelin",
            "genre": "Rock and Roll"
        },
        {
            "name": "I Cannot Quit You Baby",
            "local": "ICannotQuitYouBaby",
            "album":"Coda",
            "artist":"Led Zeppelin",
            "genre": "Rock and Roll"
        },
        {
            "name": "Ozone baby",
            "local": "Ozonebaby",
            "album":"Coda",
            "artist":"Led Zeppelin",
            "genre": "Rock and Roll"
        },
        {
            "name": "Poor Tom",
            "local": "PoorTom",
            "album":"Coda",
            "artist":"Led Zeppelin",
            "genre": "Rock and Roll"
        },
        {
            "name": "Walk of Walter",
            "local": "WalkofWalter",
            "album":"Coda",
            "artist":"Led Zeppelin",
            "genre": "Rock and Roll"
        },
        {
            "name": "We are Gonna Groove",
            "local": "WeareGonnaGroove",
            "album":"Coda",
            "artist":"Led Zeppelin",
            "genre": "Rock and Roll"
        },
        {
            "name": "Babe Im gonna leave you",
            "local": "BabeImgonnaleaveyou",
            "album":"Remasters I",
            "artist":"Led Zeppelin",
            "genre": "Rock and Roll"
        },
        {
            "name": "Good times bad times",
            "local": "Goodtimesbadtimes",
            "album":"Remasters I",
            "artist":"Led Zeppelin",
            "genre": "Rock and Roll"
        },
        {
            "name": "Ramble on",
            "local": "Rambleon",
            "album":"Remasters I",
            "artist":"Led Zeppelin",
            "genre": "Rock and Roll"
        },
        {
            "name": "Rock and roll",
            "local": "Rockandroll",
            "album":"Remasters I",
            "artist":"Led Zeppelin",
            "genre": "Rock and Roll"
        },
        {
            "name": "Since Ive been loving you",
            "local": "SinceIvebeenlovingyou",
            "album":"Remasters I",
            "artist":"Led Zeppelin",
            "genre": "Rock and Roll"
        },
        {
            "name": "Stairway to heaven",
            "local": "Stairwaytoheaven",
            "album":"Remasters I",
            "artist":"Led Zeppelin",
            "genre": "Rock and Roll"
        },
        {
            "name": "Aneurysm",
            "local": "Aneurysm",
            "album":"From the Muddy Banks of the Wishkah",
            "artist":"Nirvana",
            "genre": "Grunge"
        },
        {
            "name": "Been A Son",
            "local": "BeenASon",
            "album":"From the Muddy Banks of the Wishkah",
            "artist":"Nirvana",
            "genre": "Grunge"
        },
        {
            "name": "Heart-Shaped Box",
            "local": "Heart-ShapedBox",
            "album":"From the Muddy Banks of the Wishkah",
            "artist":"Nirvana",
            "genre": "Grunge"
        },
        {
            "name": "Lithium",
            "local": "Lithium",
            "album":"From the Muddy Banks of the Wishkah",
            "artist":"Nirvana",
            "genre": "Grunge"
        },
        {
            "name": "Polly",
            "local": "Polly",
            "album":"From the Muddy Banks of the Wishkah",
            "artist":"Nirvana",
            "genre": "Grunge"
        },
        {
            "name": "Smells Like Teen Spirit",
            "local": "SmellsLikeTeenSpirit",
            "album":"From the Muddy Banks of the Wishkah",
            "artist":"Nirvana",
            "genre": "Grunge"
        },
        {
            "name": "Bohemian Rhapsody",
            "local": "BohemianRhapsody",
            "album":"Queen Collection",
            "artist":"Queen",
            "genre": "Classic Rock"
        },
        {
            "name": "A Kind Of Magic",
            "local": "AKindOfMagic",
            "album":"Queen Collection",
            "artist":"Queen",
            "genre": "Classic Rock"
        },
        {
            "name": "Radio Ga Ga",
            "local": "RadioGaGa",
            "album":"Queen Collection",
            "artist":"Queen",
            "genre": "Classic Rock"
        },
        {
            "name": "Spread Your Wings",
            "local": "SpreadYourWings",
            "album":"Queen Collection",
            "artist":"Queen",
            "genre": "Classic Rock"
        },
        {
            "name": "Under Pressure",
            "local": "UnderPressure",
            "album":"Queen Collection",
            "artist":"Queen",
            "genre": "Classic Rock"
        },
        {
            "name": "We Will Rock You",
            "local": "WeWillRockYou",
            "album":"Queen Collection",
            "artist":"Queen",
            "genre": "Classic Rock"
        },
        {
            "name": "Fix you",
            "local": "Fixyou",
            "album":"X and Y",
            "artist":"Coldplay",
            "genre": "Pop"
        },
        {
            "name": "Speed Of Sound",
            "local": "SpeedOfSound",
            "album":"X and Y",
            "artist":"Coldplay",
            "genre": "Pop"
        },
        {
            "name": "Talk",
            "local": "Talk",
            "album":"X and Y",
            "artist":"Coldplay",
            "genre": "Pop"
        },
        {
            "name": "The Hardest Part",
            "local": "TheHardestPart",
            "album":"X and Y",
            "artist":"Coldplay",
            "genre": "Pop"
        },
        {
            "name": "What If",
            "local": "WhatIf",
            "album":"X and Y",
            "artist":"Coldplay",
            "genre": "Pop"
        }
    ],

    "information":[
        {
            "artist":"Coldplay",
            "picture":"coldplay.jpg",
            "texto":"<P>Coldplay are a British rock band formed in 1996 by lead vocalist Chris Martin and lead guitarist Jonny Buckland at University College London (UCL). After they formed under the name Pectoralz, Guy Berryman joined the group as a bassist and they changed their name to Starfish. Will Champion joined as a drummer, backing vocalist, and multi-instrumentalist, completing the line-up. Manager Phil Harvey is often considered an unofficial fifth member. The band renamed themselves 'Coldplay' in 1998, before recording and releasing three EPs; Safety in 1998, Brothers & Sisters as a single in 1999 and The Blue Room in the same year. The latter was their first release on a major label, after signing to Parlophone.</P><P>They achieved worldwide fame with the release of the single 'Yellow' in 2000, followed by their debut album released in the same year, Parachutes, which was nominated for the Mercury Prize. The band's second album, A Rush of Blood to the Head (2002), was released to critical acclaim and won multiple awards, including NME's Album of the Year. They have also come top of the BBC Radio 2 poll of the favourite album of all time. Their next release, X&Y, the best-selling album worldwide in 2005, was met with mostly positive reviews upon its release, though some critics felt that it was inferior to its predecessor. The band's fourth studio album, Viva la Vida or Death and All His Friends (2008), was produced by Brian Eno and released again to largely positive reviews, earning several Grammy Award nominations and wins at the 51st Grammy Awards. On 24 October 2011, they released their fifth studio album, Mylo Xyloto, which received mixed to positive reviews, topped the charts in over 34 countries, and was the UK's best-selling rock album of 2011. In March 2014, they announced their new album, entitled Ghost Stories, will be released on 19 May, the same year.</P> <P>The band has won a number of music awards throughout their career, including eight Brit Awards—winning Best British Group three times, five MTV Video Music Awards and seven Grammy Awards from 25 nominations. Coldplay have sold more than 70 million records worldwide. In December 2009, Rolling Stone readers voted the group the fourth-best artist of the 2000s.[12] Coldplay have been an active supporter of various social and political causes, such as Oxfam's Make Trade Fair campaign and Amnesty International. The group have also performed at various charity projects such as Band Aid 20, Live 8, Sound Relief, Hope for Haiti Now: A Global Benefit for Earthquake Relief, The Secret Policeman's Ball, Sport Relief and the Teenage Cancer Trust.</P>"
        },
        {
            "artist":"Queen",
            "picture":"queen.jpg",
            "texto":"<p> Queen are a British rock band formed in London in 1970, originally consisting of Freddie Mercury (lead vocals, piano), Brian May (guitar, vocals), John Deacon (bass guitar), and Roger Taylor (drums, vocals). Queen's earliest works were influenced by progressive rock, hard rock and heavy metal, but the band gradually ventured into more conventional and radio-friendly works, incorporating further diverse styles into their music.</p> <p> Before joining Queen, Brian May and Roger Taylor had been playing together in a band named Smile with bassist Tim Staffell. Freddie Mercury (then known by his birth name of Farrokh 'Freddie' Bulsara) was a fan of Smile, and encouraged them to experiment with more elaborate stage and recording techniques after Staffell's departure in 1970. Mercury himself joined the band shortly thereafter, changed the name of the band to 'Queen', and adopted his familiar stage name. John Deacon was recruited prior to recording their eponymous debut album in 1973. Queen enjoyed success in the UK with their debut and its follow-up, Queen II in 1974, but it was the release of Sheer Heart Attack later in 1974 and A Night at the Opera in 1975 that gained the band international success. The latter featured 'Bohemian Rhapsody', which stayed at number one in the UK Singles Chart for nine weeks; it charted at number one in several other territories, and gave the band their first top ten hit on the US Billboard Hot 100. Their 1977 album, News of the World, contained two of rock's most recognisable anthems, 'We Will Rock You' and 'We Are the Champions'. By the early 1980s, Queen were one of the biggest stadium rock bands in the world, and their performance at 1985's Live Aid is regarded as one of the greatest in rock history. In 1991, Mercury died of bronchopneumonia, a complication of AIDS, and Deacon retired in 1997. Since then, May and Taylor have infrequently performed together, including a collaboration with Paul Rodgers under the name Queen + Paul Rodgers which ended in May 2009. In 2013, May and Taylor will tour with Adam Lambert under the name of Queen + Adam Lambert.</p><p> The band have released a total of 18 number one albums, 18 number one singles, and 10 number one DVDs. Estimates of their album sales generally range from 150 million to 300 million albums, making them one of the world's best-selling music artists. They received the Outstanding Contribution to British Music Award from the British Phonographic Industry in 1990, and were inducted into the Rock and Roll Hall of Fame in 2001.</p>"
        },
        {
            "artist":"Nirvana",
            "picture":"nirvana.jpg",
            "texto":"<p>Nirvana was an American rock band formed by singer/guitarist Kurt Cobain and bassist Krist Novoselic in Aberdeen, Washington in 1987. Nirvana went through a succession of drummers, the longest-lasting being Dave Grohl, who joined the band in 1990. Despite releasing only three full-length studio albums in their seven-year career, Nirvana has come to be regarded as one of the most influential and important rock bands of the modern era.</p> <p>In the late 1980s Nirvana established itself as part of the Seattle grunge scene, releasing its first album Bleach for the independent record label Sub Pop in 1989. The band eventually came to develop a sound that relied on dynamic contrasts, often between quiet verses and loud, heavy choruses. After signing to major label DGC Records, Nirvana found unexpected success with  Smells Like Teen Spirit , the first single from the band's second album Nevermind (1991). Nirvana's sudden success widely popularized alternative rock as a whole, and the band's frontman Cobain found himself referred to in the media as the  spokesman of a generation , with Nirvana being considered the  flagship band  of Generation X. Nirvana's third and final studio album, In Utero (1993), featured an abrasive, less-mainstream sound and challenged the group's audience. The album did not match the sales figures of Nevermind but was still a critical and commercial success. Nirvana's brief run ended following the death of Kurt Cobain in 1994, but various posthumous releases have been issued since, overseen by Novoselic, Grohl, and Cobain's widow Courtney Love.</p><p>Since its debut, the band has sold over 25 million records in the United States alone, and over 75 million records worldwide, making them one of the best-selling music artists in history. Four of their albums, two studio and two live, have reached the number one spot on the Billboard 200 chart. In the years since the band's breakup, Nirvana has been ranked highly on several lists by various publications as one of the greatest artists of all time. Rolling Stone described Nirvana's influence as having  kicked in  the 1990s as a musical era, adding that their music  guaranteed the nineties would not suck, and claimed that the band  transformed rock for a generation. According to the magazine,  few bands in rock history have had a more immediate and tangible impact on their contemporary pop musical landscape than Nirvana did in the early Nineties.</p><p>Nirvana was inducted into the Rock and Roll Hall of Fame in 2014, the band's first year of eligibility; the museum's biography of the band states that Nirvana  start[ed] a rock revolution  and  remain an enduring influence and challenge , before declaring them  proof that the right band with the right noise can change the world."
        },
        {
            "artist":"Led Zeppelin",
            "picture":"led.jpg",
            "texto":"<p>Led Zeppelin foi uma banda britânica de rock, formada em Londres em setembro de 1968. A banda consistia no guitarrista Jimmy Page, o vocalista Robert Plant, o baixista e tecladista John Paul Jones e o baterista John Bonham. Com o seu som pesado de guitarra, e o som de blues rock de seus dois primeiros álbuns, o Led Zeppelin é frequentemente reconhecido como um dos progenitores do hard rock e heavy metal. O estilo único da banda criou uma grande variedade de influências, e eles são amplamente considerados um dos grupos de rock de maior sucesso, inovação e influência na história.</p><p>Depois de mudar o nome de New Yardbirds, Led Zeppelin assinou um acordo favorável com a Atlantic Records, que lhes ofereceu uma considerável liberdade artística. O grupo não gostava de lançar as suas canções como singles, pois eles viam os seus álbuns como indivisíveis e uma completa experiência de escuta. Embora inicialmente impopular com os críticos, o grupo conseguiu um impacto comercial significativo nas vendas de Led Zeppelin, Led Zeppelin II, Led Zeppelin III, o seu quarto álbum sem título, Houses of the Holy, e Physical Graffiti. O quarto álbum, que apresenta a faixa  Stairway to Heaven , está entre as obras mais populares e influentes do rock, e ajudou a cimentar a popularidade do grupo.</p><p>Álbuns posteriores do grupo visaram uma experimentação maior e foram acompanhados por extensos recordes e concertos que renderam à banda uma reputação pelos seus excessos e a sua devassidão. Apesar de terem permanecido bem sucedidos comercialmente e criticamente, a sua produção e agenda de shows foram limitadas no final de 1970, e o grupo se desfez após a morte repentina de Bonham em 1980. Desde então, ao decorrer das décadas, os membros sobreviventes esporadicamente colaboraram e participaram de raras reuniões juntos. O mais bem sucedido deles foi em 2007 no Ahmet Ertegun Tribute Concert, em Londres, com Jason Bonham no lugar de seu falecido pai, na bateria.</p><p>Led Zeppelin é amplamente considerado como um dos grupos de rock mais bem sucedidos, inovadores e influentes da história. Eles são um dos artistas que mais venderam na história da música, várias fontes estimam recordes de vendas do grupo entre 800 a 950 milhões de unidades em todo o mundo. Com 111,5 milhões de unidades certificadas pela RIAA, eles são a segunda banda de maior recorde de vendas de discos nos Estados Unidos.2 Cada um de seus nove álbuns de estúdio foram colocados no Billboard Top 10 e seis deles atingiram o número um.3 A revista Rolling Stone descreveu como  a banda mais pesada de todos os tempos ,4  a maior banda dos anos 70 5 e  sem dúvida, uma das bandas mais marcantes da história do rock .6 Eles foram introduzidos no Rock and Roll Hall of Fame em 1995, sua biografia no museu demonstra que a banda era  tão influente na década dos anos 1970, como os Beatles na década anterior.</p>"

        },
        {
            "artist":"Black Eyed Peas",
            "picture":"peas.jpg",
            "texto":"<p>The Black Eyed Peas are an American hip hop group, consisting of rappers will.i.am, apl.de.ap, Taboo, and singer Fergie. Originally an alternative hip hop group, they subsequently added R&B, pop and EDM/dance influences. Although the group was founded in Los Angeles in 1995, it was not until the release of their third album Elephunk in 2003 that they found widespread acclaim and achieved high record sales. Since that time, the group has sold an estimated 56 million records worldwide. According to Nielsen SoundScan, the Black Eyed Peas were the second-best-selling artist/group of all time for downloaded tracks, with over 42 million sales as of the end of 2011.</p><P>Their first major hit was the 2003 single 'Where Is the Love?' from Elephunk, which topped the charts in 13 countries, including the United Kingdom, where it spent seven weeks at number one and went on to become Britain's biggest selling single of 2003. Another European hit single from the album was 'Shut Up'. Their fourth album, Monkey Business, was an even bigger worldwide success, certified 4× Platinum in the U.S., and spawning four singles, 'Don't Phunk with My Heart', 'Don't Lie', 'My Humps' and 'Pump It'. In 2009, the group became one of only 11 artists to have simultaneously held the No. 1 and No. 2 spots on the Billboard Hot 100, with their singles 'Boom Boom Pow' and 'I Gotta Feeling', which topped the chart for an unprecedented 26 consecutive weeks. This album The E.N.D. later produced a third Hot 100 number-one placement with 'Imma Be', making the group one of few to ever place three number one singles on the chart from the same album, before being followed with 'Rock That Body' and 'Meet Me Halfway', which peaked in the Top 10 of the Hot 100. 'I Gotta Feeling' became the first single to sell more than one million downloads in the United Kingdom.</P><P>The Black Eyed Peas were ranked 12th on Billboard's Decade-End Chart Artist of the Decade, and 7th in the Hot 100 Artists of the Decade. At the 52nd Grammy Awards ceremony, held in January 2010, they won three awards out of six nominations. In November 2010, they released the album The Beginning. In February 2011, the group performed at the Super Bowl XLV halftime show. The album's first two singles, 'The Time (Dirty Bit)' and 'Just Can't Get Enough', became international hits and topped the charts in many countries. The single 'Don't Stop the Party' became an international hit too.</P>"
        }

    ]



}
